<!DOCTYPE html>
<html> 
    <body>   
        <form method="post" action=" ">
        <div>            
            <input type="number"  name="rainp">Въведете процента(%) валежи            
            </div>      
             <button type="submit"  value="Submit">Изпрати</button> 
            </form>        
    <?php
        if($_POST){
            $rainP=$_POST["rainp"];        
        if($rainP>=0 && $rainP<=10)
        { 
            echo "Днес има $rainP % възможност за валежи"."<br>"."Съвет: Няма опастност!";
        }
        elseif($rainP>=11 && $rainP<=20)
        { 
            echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Леки превалявания, няма нужда от спешни мерки!";
        }
        elseif($rainP>=21 && $rainP<=30)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Вземете си чадър!";
        }
        elseif($rainP>=31 && $rainP<=40)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Вземете си чадър и яке!";
        }
        elseif($rainP>=41 && $rainP<=50)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Вземете си чадър, яке и плътни обувки!";
        }
        elseif($rainP>=51 && $rainP<=60)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Вземете си голям и здрав чадър, заедно с плътни обувки и яке!";
        }
        elseif($rainP>=61 && $rainP<=70)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"." Съвет: Вземете дъждобран, плътни дрехи и голям чадър!";
        }
        elseif($rainP>=71 && $rainP<=80)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Сипете 20 лева на колата и излезте с нея!";
        }
        elseif($rainP>=81 && $rainP<=90)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет:  Извадете бански, шнорхели, плувки и бъдете готови да плувате!";
        }
        elseif($rainP>=91 && $rainP<=100)
        { 
             echo "Днес има $rainP % възможност за валежи."."<br>"."Съвет: Вадете лодката, че ще се удавите!!!";
        }
        else{
           echo "Грешно въведени проценти! Моля въведете проценти между 0-100!";
        };
        };              
    ?>
    </body>    
</html>